Repository: JianLaiTL/JianLai
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 宁姚一手捏着下巴，一手托着手肘，那双眼眸流光溢彩，缓缓道：“如果我没有猜错，你家拳谱的剑炉正是脱胎于此，不过不是现在你看到的这双手，而是这尊道教灵官像之前中间那对手臂，就是由消失的那双手掐诀而出的剑炉，虽然我不知道为何撰写拳谱之人只选其一，并且没有选择现在咱们看到的这个手势，但是我可以确定一点，剑炉，或者说灵官指剑掐诀，说不定有大小之分。”
en_us: With one hand pinching her chin and one hand resting under her elbow, there was a glimmer in Ning Yao's eyes as she said, "If my guess isn't wrong, the Sword Furnace from your Mountain Shaking Guide is derived from this statue's stance. However, it's not derived from the pair of hands that you can see right now. Instead, it was derived from the middle two arms of this statue of a Daoist Enforcer. It was those two arms that formed the stance of the Sword Furnace. However, I'm not sure why the author of the fist guide only chose one pair of arms to use as inspiration, ignoring the two hands that we can still see now. In any case, I can say with certainty that the Sword Furnace, or the Enforcer Sword Finger Hand Seal, is divided into two levels — big and small."

source: 宁姚一手支撑着腮帮，一手翻翻捡捡那些蛇胆石，道：“在小镇这里，没有什么是一袋子金精铜钱解决不了的，如果有，那就两袋。”
en_us: Ning Yao rested her cheek on one hand while sorting through the snake gall pebbles with her other hand, and she said, "There's no problem in this town that can't be resolved with a pouch of gold essence copper coins. If there is, then two pouches will be sure to suffice."

source: 宁姚一挑狭长眉毛，手肘一扫，那颗石头被扫落桌面。
en_us: Ning Yao raised an eyebrow upon hearing this, and she knocked the pebble off the table with a sweep of her arm.

source: 宁姚一挑眉头。
en_us: Ning Yao raised an eyebrow.

source: 宁姚一挑眉头，替他加了三个字，“怎么可能这么少？”
en_us: Ning Yao raised a brow and helped him correct his words, saying, "How is it possibly so few?"

source: 宁姚一挑眉毛。
en_us: Ning Yao raised an eyebrow.

source: 宁姚一眼就看出端倪，明白了陈平安为何要急匆匆带自己来到此地，点头道：“的确有些像撼山谱上的那个立桩拳架子，只不过跟拳谱上的剑炉，有点不同。”
en_us: Ning Yao immediately noticed something, and she understood why Chen Ping'an had hurriedly brought her over here. She nodded and said, "It does indeed look a bit like the standing meditation stance from the Mountain Shaking Guide. However, its a little bit different from the Sword Furnace stance from the guide."

source: 宁姚一脸不信，满满的讥讽神色。
en_us: Ning Yao merely sneered in response, completely unconvinced by Chen Ping'an's words.

source: 宁姚下意识伸出一根手指，揉了揉眉心。
en_us: She unconsciously raised a finger and massaged her glabella.

source: 宁姚不再捉弄陈平安，正色问道：“你以后做什么？”
en_us: Ning Yao didn't tease Chen Ping'an any longer, and a serious look appeared on her face as she asked, "What are you going to do from here?"

source: 宁姚不再说话。
en_us: Ning Yao didn't say anything else.

source: 宁姚不忘转头对陈平安眨眨眼，“我这是借，不是抢，明白不？”
en_us: Ning Yao didn't forget to turn to Chen Ping'an, blinking and saying, "I'm borrowing it, not stealing it, understand?"

source: 宁姚不打算告诉他真相，只给出一个模糊答案，“齐先生既然是这座洞天的主人，应该跟他有关系吧。”
en_us: Instead of telling him the truth, Ning Yao gave a rather ambiguous response. "Mr. Qi is the master of this small world, so it probably has something to do with him."

source: 宁姚不明就里，讶异道：“陈平安，你是不是想钱想疯了？”
en_us: Ning Yao didn't know where he was coming from, and she said in astonishment, "Chen Ping'an, have you gone mad thinking about money?"

source: 宁姚不等陈平安说话，沉声道：“所以当初陆道长让你不管如何，都要厚着脸皮待在铁匠铺子，是一条正路。”
en_us: Before Chen Ping'an had a chance to reply, Ning Yao continued in a solemn voice, "This is why Daoist Lu told you to remain at Master Ruan's forge no matter what. That's the only way to keep yourself safe."

source: 宁姚不置可否，轻轻摇晃手中绿刀，就像乡野少女摇晃着花枝。
en_us: Ning Yao didn't comment on this. Like a young girl waving a flower branch in the countryside, she lightly waved the green scabbard in her hand.

source: 宁姚也摇摇头，“没感觉。”
en_us: Ning Yao shook her head and replied, "No."

source: 宁姚也有意无意轻轻说了句，“这名字真俗气。”
en_us: "What a tacky name Zhi Gui is," Ning Yao retorted, also pretending as if she were only speaking to herself.

source: 宁姚也笑了，“还有一种小洞天，就是收纳物品的地方，佛家有须弥芥子一说，道家则是袖有乾坤，其余百家也各有各的说法，其宗旨都是‘方寸之地容天地’，简而言之，就是说一点点大的物件，能够放下很多玩意儿，只是相较真正的洞天福地，这种冠以‘洞天’头衔的宝贝，放不得活物，我娘亲以前最值钱的嫁妆之一，就是一枚玉镯子，”里边洞天的大小，差不多是这栋屋子这么大的地方。”
en_us: Ning Yao also smiled as she said, "There is also a type of small world known as domains, and they're used for storage purposes. In Buddhism, such places are known as all-encompassing seeds, which corresponds with the concept of the world up the sleeve in Daoism, and all of the other teachings have similar concepts of their own as well. All of those concepts essentially describe a tiny place that can encompass heaven and earth. To put it in simpler terms, it's a tiny object that can store many things. However, in contrast with true blessed lands and small worlds, no living beings can be put into those domains. The most valuable item among my mother's dowry is a jade bracelet, and the domain inside is roughly the same size as this house."

source: 宁姚也跟着低头小声道：“入土为安。”
en_us: Ning Yao also lowered her head and quietly said, "Rest in peace."

source: 宁姚二话不说，腰间刀剑同时出鞘，身形一闪而逝。
en_us: Ning Yao didn't say a word as she unsheathed her sword and saber in unison, leaping forward in a flash.

source: 宁姚今天穿了yi件崭新的墨绿色长袍，干净利落，她本就长得英气勃发，这yi身衣饰，加上腰佩长刀，比起福禄街桃叶巷那边的富家子弟，更有贵气。
en_us: Ning Yao was wearing a brand new robe today, and it was dark green in color and especially smart in appearance. She already radiated with a gallant and resilient aura to begin with, and coupled with the saber by her waist, this outfit made her appear even nobler than those from the wealthy families in Fortune Street.

source: 宁姚仍然住在泥瓶巷的宅子，那个被她称呼为阮师的男人，出人意料地答应为她铸剑，更意外的是阮师还说此次铸剑，运气好的话，半年就能出炉，运气不好的，等上十年也未必成功。宁姚对此倒是心宽的很，笑着说自己运气一向不坏，等上半年便是。
en_us: Meanwhile, Ning Yao was still staying at Chen Ping'an's place in Clay Vase Alley. The man who she referred to as Master Ruan had also surprisingly agreed to forge a sword for her, and even more surprisingly, he had said that the sword might be forged in just half a year if they were fortunate. If they were unfortunate, however, this might blow out to more than 10 years. Ning Yao had been quite broad-minded about this, and she had chuckled and said that she had always been a fairly lucky person. Thus, she wouldn't mind waiting for half a year.

source: 宁姚仔细一想，“其实一样的。”
en_us: Ning Yao carefully mulled over this for a moment before saying, "It's actually the same."

source: 宁姚仔细想了想，“老猿总计出手三次，从你家泥瓶巷到小镇最西边的第一次，老猿比较含蓄，主要是为了试探你有无靠山，毕竟他当时忌惮有人在幕后布局，害怕有人针对他护送到此的正阳山小主子，所以折寿大概只在三五年之间，之后在溪畔与我对峙，二十年左右，第三次，估摸着最少五十年，接下来第四次的话，怎么都要一百年起步。”
en_us: Shen thought carefully for a moment before replying, "The old ape has fought three times. The first time was when he chased you from Clay Vase Alley to the west side of the small town. He was more cautious that time, and it was mainly because he was trying to gauge whether you had external support or not. After all, he was afraid that someone was trying to lure him into a trap and target his young master from Sun Scorch Mountain. Thus, he probably only had three to five years shaved off his lifespan. "The second time was when he fought against me by the creek. That probably shaved 20 or so years off his lifespan. The third time he fought us, he probably lost at least 50 years from his lifespan. The next time he fights us, he'll probably lose at least 100 years from his lifespan."

source: 宁姚伸手扶住额头，不想说话。
en_us: Ning Yao clapped a hand onto her forehead in a speechless manner.

source: 宁姚伸手推刀出鞘寸余，威胁道：“想被砍是不是？”
en_us: Ning Yao reached down and unsheathed an inch of her saber, saying in a threatening voice, "You want to be hacked at, do you?"

source: 宁姚低声道：“放我下来！”
en_us: "Put me down," she said in a low voice.

source: 宁姚使劲拍了拍陈平安肩膀，语重心长道：“连剑鞘也有了，距离剑仙还远吗？”
en_us: Ning Yao firmly patted Chen Ping'an's shoulder and said in a meaningful manner, "Since you already have a sword scabbard, will you be far away from becoming a Sword Immortal?"

source: 宁姚依然冷漠道：“不需要。”
en_us: "No need," Ning Yao replied, her voice still cold.

source: 宁姚侧身而坐，手肘抵在桌面上，望着少年的侧脸，调侃道：“是不是觉得自己发大财了？以后砍柴要用金斧头、吃饭要用金饭碗？”
en_us: Ning Yao sat sideways, with one arm resting on the table. She looked at the young boy and said in a teasing manner, "Do you feel like you've struck gold? Are you going to use a gold hatchet to chop wood and a gold bowl to eat your meals in the future?"

source: 宁姚信了，毫不怀疑。
en_us: Ning Yao believed him, with not even a shred of doubt remaining in her mind.

source: 宁姚停顿片刻，转头望去，那座不起眼的杨家铺子，天街小雨润如酥，雨后的药铺，轮廓柔和，水汽朦胧，少女自顾自做了一些细微修改：“杨老头，很不简单。”
en_us: Ning Yao paused for a brief moment, looking back at the unremarkable Yang Family's medicine shop. The light drizzle was fine and glistening, and it caused the outline of the medicine shop to become fuzzy and misty. Ning Yao corrected herself, murmuring, "Old Man Yang is an extraordinary person."

source: 宁姚再问，“如果只有一颗的话？”
en_us: "What if you only had one fruit?" Ning Yao asked.

source: 宁姚冷哼一声，“想笑就笑！”
en_us: "Laugh if you want to!" Ning Yao humphed coldly.

source: 宁姚冷笑道：“一位主持小洞天运转的圣人，还会怕这些麻烦？”
en_us: "You don't have to worry about a Sage capable of overseeing a small world," Ning Yao scoffed.

source: 宁姚冷笑道：“如果是对付正阳山的搬山老猿，肯定会灰头土脸，可要是那个娘们，在这座小镇上，我一只手就够了。”
en_us: Ning Yao smiled coldly and said, "If our opponent is that Mountain-moving Ape from the Sun Scorch Mountain, then I'll definitely be left in a sorry state. If it's that woman, however, I can deal with her with a single hand, especially since we're in this small town."

source: 宁姚冷笑道：“小心有命拿没命用。”
en_us: Ning Yao chuckled coldly and said, "Be careful that you won't live long enough to use it."

source: 宁姚冷笑道：“怎么，你是想在水底练习闭气，然后练出yi只千年王八万年龟啊？”
en_us: Ning Yao chuckled coldly and said, "Oh? You want to practice holding your breath underwater? Are you going to master that and then become a bastard turtle[ref]Bastard and soft-shelled turtle are homonyms in Chinese.[/ref]?"

source: 宁姚出手数次也没能得逞，灵犀一动，那只握有桃色蛇胆石的手，作势要丢出石头。
en_us: All of a sudden, a thought occurred to her, and she raised the hand that was holding the pink snake gall pebble, motioning as if she were going to throw it.

source: 宁姚刚要伸手搀扶，少年虽然口不能言，仍是眼神示意不用她帮忙。
en_us: Ning Yao was just about to reach over and help him. However, even though Chen Ping'an couldn't speak, he still gestured with his eyes that he didn't need her help;

source: 宁姚刚要附和，然后与他显摆几句既豪迈气概又有学识底蕴的圣贤箴言，不料少年很快自己就给出了答案，正儿八经地扪心自问道：“难道是我上辈子好事做少啦？可我这辈子也没来得及做啥好事善事啊，下辈子岂不是还得完蛋，咋办？”
en_us: Ning Yao was just about to answer his question and recite a few motivating sayings by the Sages to show off her knowledge. Unexpectedly, however, Chen Ping'an quickly answered his own question. He sincerely said to himself, "Perhaps I didn't do enough good deeds in my previous life? But I haven't had enough time to do good deeds in this life either! Then aren't I screwed for my next life again? What should I do?"

source: 宁姚加快脚步，跟他并肩而行，忍不住问道：“陈平安，你没事吧？”
en_us: Ning Yao quickened her pace and walked up beside him, asking, "Chen Ping'an, are you okay?"

source: 宁姚又问道：“你有事”
en_us: "Do you need something?" Ning Yao asked.

source: 宁姚又问道：“血气方刚，意气之勇，重诺言轻生死，其实巷弄游侠儿从来不缺，我一路行来，就亲眼见识过不少。只不过一旦大利当前，换了一种诱惑，他刘羡阳到底能不能守得住本心？”
en_us: "There's never a shortage of people who are hot-blooded, courageous, and prefer death over dishonor. I've seen many such people on my journey. However, when they're offered a huge fortune, can they still maintain their composure and moral compass?" Ning Yao asked.

source: 宁姚又问道：“除了齐静春，还有两个是谁？”
en_us: "Who're the other two aside from Qi Jingchun?" Ning Yao asked.

source: 宁姚又问，“那如果你手上只有两颗野果，你是给我，还是给阮秀？”
en_us: "If you only had two fruits in your possession, would you give them to me or Ruan Xiu?"

source: 宁姚又问，“齐先生，你在这里，是不是什么事情都知道？”
en_us: "Mr. Qi, are you all-knowing in this place?" Ning Yao asked.

source: 宁姚双手做了一下气沉丹田的姿势，告诉自己：“大人有大量。”
en_us: Ning Yao took a deep breath and told herself that mighty people should be tolerant and magnanimous.

source: 宁姚双手按在白鞘长剑之上，眯眼道：“我之前话只说了一半，愧疚是一半，再就是自离家出走以来，我宁姚行走天下，从来没有遇到一个坎就绕过去的时候！”
en_us: Ning Yao set her hands down on the scabbard of her longsword, and her eyes narrowed slightly as she said, "I didn't tell you the full story just now. Guilt is only half the reason I'm doing. The other half is that ever since I ran away from home to explore the world, there's never been a hurdle that I've run into that I've gone around rather than tackled head-on! That applies to both physical hurdles and hurdles in here!"

source: 宁姚双手环胸，满脸天经地义的正气表情，反问道：“不然咧？！”
en_us: Ning Yao crossed her arms before her chest, her expression proper and righteous as she said, "What else could it be like?"

source: 宁姚双手轻轻踢着背篓，随口问道：“是留着给那个叫陈对的女子？”
en_us: Ning Yao gently patted the basket in an absentminded manner with her hands as she asked, "Are you saving it for Chen Dui?"

source: 宁姚反问道：“你觉得他们母子在泥瓶巷过得不好？”
en_us: "You feel like their life in Clay Vase Alley wasn't good?" Ning Yao replied.

source: 宁姚叹了口气，“至于最后一种，是只可意会了，不可言传，连说也说不得，说也无法说。打个比方，这趟进来小镇的两股势力，云霞山的蔡金简，她的云霞山，有观云海一事，云海滔滔，云雾霞光尤为特殊，蕴藉灵气，被你们东宝瓶洲炼气士誉为天上尤物，有些能够自行幻化成历代祖师爷，若有机缘者，就能与之会晤交流，而正阳山之巅的浓郁剑气，据说阴差阳错，因缘际会，也会出现正阳各峰老祖的剑灵，演化剑道，至于能否看到，只看福分大小，不看身份贵贱，不看修为高低。”
en_us: Ning Yao sighed before continuing, "As for the last type, the focus is on teaching in a manner that can only be felt and understood in one's mind, but cannot be explained in words. For example, let's look at the two forces that entered the small town this time. There was Cai Jinjian, and the Dawn Cloud Mountain that she comes from practices something called Observing the Sea of Clouds. The sea of clouds is vast, and the iridescent light that they radiate with is especially unique, and they more so contain an abundant amount of spiritual energy. The qi refiner in the Eastern Treasured Vial Continent refer to these clouds as beauties in the sky. Some of these clouds and iridescent lights can transform into the shape of previous masters and ancestors, and those who are fated can even communicate and interact with them. "Meanwhile, when it is so fated, it's said that the sword spirits of ancient ancestors from different peaks will also appear at the peak of the Sun Scorch Mountain. This is a mountain peak that's brimming with sword intent. These sword spirits will display the Sword Dao, and as for who can witness this, this isn't determined by one's age, status, or cultiation.

source: 宁姚叹了口气，下定决心道：“陈平安，先放我下来，然后背我去你说的那个地方。”
en_us: Ning Yao sighed before making up her mind and saying, "Chen Ping'an, put me down first. Then carry me on your back to that place you mentioned."

source: 宁姚叹了口气，真是拿他没辙，“接下来去哪儿？”
en_us: Ning Yao sighed in exasperation. She was truly unable to speak any reason into him. "Where are we headed now?"

source: 宁姚叹气道：“这类天地异象而生的凶兽遗种，窍穴远不如我们人来得别有洞天，虽然因此而修行极难，但好处是精气神的流逝，也更加缓慢，使得极为长寿，少则五百年，多则五千年的寿命，搬山猿生性善动不喜静，若无修行，寿命不会太长，自然不如龟蛟之流，但是搬山猿终究是曾经的一方霸主，寿命依旧长达两千岁左右，而且这头护山猿，显然已经修成了道法神通，一旦被他跻身上五境，加上他第九境的体魄，别说两千年寿命，就是三千年，四千年，也不是没有可能。”
en_us: Ning Yao sighed and said, "As descendants of ancient beasts born from the peculiar phenomenon of heaven and earth, the acupoints of these beasts are far inferior to those of us humans. As such, it's extremely difficult for them to cultivate. However, the good thing about this is that their vitality is eroded far slower than ours, and this allows them to enjoy extremely long lifespans. On the lower end, they can enjoy a life span of 500 years, while on the higher end, they can enjoy a life span of 5000 years. "Mountain-moving Apes like to move around a lot, so if they don't cultivate, they naturally won't enjoy an excessively long lifespan. They naturally won't live for as long as tortoises and flood dragons. However, the Mountain-moving Apes used to be the dominant force of some region in the past, after all, so their lifespans can still reach up to 2000 years. Moreover, this old ape has clearly mastered some mystical abilities already, so once he advances to the Upper Five Tiers, combined with his Ninth Tier physique, it's possible that he can enjoy a lifespan of 3000 years or even 4000 years, to say nothing of just 2000 years."

source: 宁姚听过之后，没有发表意见，只说这是你们之间的事情，她只管收人钱财替人消灾，如果刘羡阳能够不用她出手就躲过一劫，她自会返还那三袋子金精铜钱。陈平安说这不是钱的事情，结果宁姚冷冰冰回了一句，那你是要跟我谈感情，咱俩到那份上啦？陈平安差点被她这句话噎死，只好蹲在门槛那边挠头。
en_us: Ning Yao didn't comment on this, and she simple said that this was something between him and Liu Xianyang. She also said that she was only responsible for accepting money to deal with any potential problems for them. If Liu Xianyang could overcome this challenge without needing her help, she would naturally return the three pouches of gold essence copper coins to them. However, Chen Ping'an said that this had nothing to do with money. Upon hearing this, Ning Yao coldly asked him what their relationship was to talk in such a manner. Chen Ping'an was rendered speechless by her, and he could only squat by the door and scratch his head.

source: 宁姚呵呵笑道：“你以为我是谁？”
en_us: "Do you think I'm just anyone?" Ning Yao chuckled.

source: 宁姚和陈平安此刻关注的侧重点，截然不同。
en_us: Ning Yao and Chen Ping'an were focused on two starkly different matters at this moment.

source: 宁姚哈哈大笑，“看把你吓的，我开玩笑呢。”
en_us: Ning Yao roared with laughter and said, "I'm just joking! Look at how terrified you became!"

source: 宁姚嗯了一声，“但是告诉你一个不好的小溪，老猿最少还能再坏一次规矩。对付咱俩两个伤患，多半是绰绰有余。”
en_us: "Mhm. However, I've got some bad news for you," Ning Yao replied. "He can break the rules at least one more time, and that's more than enough to deal with us two injured people."

source: 宁姚嗯了一声，“武道中人，可能会称为磨刀石，或者磨剑石，山上剑修才会将其喊作斩龙台。”
en_us: "Mhm. Martial artists might refer to them as saber whetstones or sword whetstones, and only swordsmen will refer to them as Dragon Slaying Platforms," Ning Yao replied.

source: 宁姚嘴唇微动，仍是没有阻拦，只是趁陈平安不注意的时候抹了把脸。
en_us: Ning Yao's lips moved slightly, yet she eventually didn't say anything to stop him. She simply seized an opportunity when he wasn't looking to wipe her face clean.

source: 宁姚嘴角翘起，伸出两根手指，轻轻捻动，道：“最小，就这么点大，弹丸之地，不值一提。”
en_us: The corners of Ning Yao's lips curved up slightly as she held up two of her fingers in pinching motion and replied, "It's the tiniest and most insignificant of the small worlds."

source: 宁姚在天没亮就离开小镇了，阮秀说是倒悬山那边，飞剑传书，宁姑娘听说后急匆匆就离开了铺子。
en_us: Ning Yao had left the town before first light, and Ruan Xiu told him that she had left the blacksmith shop in a hurry after receiving a letter by flying sword from Stalactite Mountain.

source: 宁姚坐在陈平安桌对面，瞥了眼陈平安手中的簪子，“我仔细查看过了，的确是普通的簪子而已，没有暗藏玄机，一开始我还以为是座小洞天呢。”
en_us: Ning Yao sat down across the table from Chen Ping'an, then took a glance at the hairpin that he was holding as she said, "I've examined that thing carefully, and it really is just an ordinary hairpin that's not special in any way. In the beginning, I thought it was a small world."

source: 宁姚坐进并不显狭窄逼仄的小窝，如释重负。
en_us: Ning Yao felt a sense of relief as she sat in the hut that didn't feel too cramped.

source: 宁姚坦然受之，“我宁姚亲自拣选的刀剑，当然不孬！”
en_us: Ning Yao calmly accepted this praise. "The swords and sabers that I choose are naturally not bad!"

source: 宁姚大步前行。
en_us: Ning Yao strode forward.

source: 宁姚天生剑心通明，夜间视物，轻而易举，便发现破败墙壁上满是稚童的炭笔涂鸦，大多是人名，低处多半已经斑驳不清，或是被人涂抹篡改，或是重重叠叠，只是高一些的地方，还有一些清晰可见的名字，宋集薪，稚圭，赵繇，谢实，曹曦很长一大串，估计是当年骑在脖子上，甚至是站在小伙伴的肩膀上写的，宁姚甚至看到了刘羡阳和陈平安、顾粲三人的名字，聚在左上角最高的地方，显得不太合群。
en_us: Ning Yao was born a sword prodigy, and she could easily see things even in the dark. This allowed her to quickly discover the childish grafitti on the broken walls of the temple. Written using charcoal crayons, most of the graffiti was the names of people. The characters near the bottom of the wall had already become smudged and unlear, and perhaps they had been rubbed off or written over by others. Only the characters higher up were still clear and intact, and she could easily make out the names of several people — Song Jixin, Zhi Gui, Zhao Yao, Xie Shi, Cao Xi, and so on. Perhaps they had sat or even stood on the shoulders of their friends to write their names up so high. In fact, Ning Yao even saw Liu Xianyang, Chen Ping'an, and Gu Can's names written on the uppermost left corner of the wall. Their names appeared slightly distant and disjointed from the rest of the names.

source: 宁姚嬉笑一声，从桌面下伸出另外一只手，那颗本该摔落在地的石头，赫然躺在她的白皙手心。
en_us: Ning Yao grinned as she extended her other hand out from under the table, and as it turned out, she had caught the pebble before it fell onto the ground.

source: 宁姚实在受不了这老头子阴阳怪气的言语，沉声道：“杨老先生，能不能先帮陈平安止痛？”
en_us: Ning Yao was truly unable to endure the old man's cruel words, and she asked solemnly, "Mr. Yang, can you please give Chen Ping'an some painkillers first?"

source: 宁姚对此根本就是置若罔闻，始终在寻找这头老猿的真正软肋。
en_us: Ning Yao completely ignored his remarks. From the beginning to the end, she was observing him and looking for his weak points.

source: 宁姚对此深信不疑，就像她始终坚信自己将来一定会成为大剑仙，不是什么凤毛麟角、屈指可数，而是唯我一人的那种。
en_us: Ning Yao firmly believed this, just like how she firmly believed that she would definitely become a mighty Sword Immortal in the future. Not one of the most powerful, but the most powerful.

source: 宁姚就站在“气冲斗牛”的匾额下，开口问道：“怎么样？”
en_us: She was standing right under the plaque that read "unmatched aura", and she asked, "How did it go?"

source: 宁姚差点就被老猿一掌按在额头之上，身体向后仰去的同时，伸手握住飞剑剑柄，然后被硬生生扯出老猿的那一掌范围，整个人就像被人拖拽着条胳膊，往后滑去。
en_us: Ning Yao was almost struck in the forehead by the old ape. As she leaned back, she reach out to grab the hilt of her flying sword, which forcefully dragged her back and out of the range of Bai Yuan's attacks.

source: 宁姚已经向前踏出一步，用东宝瓶洲正统雅言说道：“让陈平安带你去找坟头祭祖没问题，但是你得拿出两袋金精铜钱，没得商量！他这会儿受伤很重，不易长途跋涉，你也清楚，如今齐先生让人速速离开小镇，陈平安不过是一个凡夫俗子，却必须要加快赶路，一袋钱，不够。”
en_us: However, Ning Yao had already stepped forward and replied using the official dialect of the Eastern Treasured Vial Continent, "It's not an issue for Chen Ping'an to bring you to your ancestors' graves to worhsip them. However, you need to pay him two pouches of gold essence copper coins. There's no room for discussion! He's severely wounded right now, so it's not easy for him to trek such long distances. Moreover, you're also aware that Mr. Qi has told us outsiders to leave the small town as soon as possible. Chen Ping'an is only a mortal, yet you need him to increase his pace to bring you there. So, one pouch of gold essence copper coins... isn't enough!"

source: 宁姚强忍住怒气，小心翼翼让陈平安坐在长凳上，只是她刚一放手，少年就摇摇欲坠。
en_us: Ning Yao forcefully suppressed her anger as she carefully placed Chen Ping'an down on the long bench. However, Chen Ping'an immediately swayed and looked like collapsing when she let go of him.

source: 宁姚当然无所谓，蹲在陈平安附近，百无聊赖的她双手手心，分别抵住刀柄剑柄，轻轻下压，刀鞘剑鞘尾端随之轻轻敲击青色石崖，一声一声，与溪水声唱和一般。
en_us: Ning Yao naturally didn't mind this. She squatted near Chen Ping'an, and she held the hilts of her sword and saber in boredom, lightly pressing down on them and causing the tip of the scabbards to lightly tap against the green cliff face. The crisp clacking sound was seemingly singing a harmony with the whoosh of the stream water.

source: 宁姚当然脸色不太好看，只是不等她说什么，会说小镇方言的刘灞桥就已经转头，对陈平安伸出一根大拇指，这位风雷园的天才剑修，眼神清澈道：“只是一副凡人之躯，就敢叫板正阳山护山猿，关键还活下来了，简直就是一个奇迹！”
en_us: Ning Yao's expression naturally grew dark. However, before she could even say anything, Liu Baqiao — who could speak the dialect of the small town — had already turned around and raised a thumb at Chen Ping'an. The eyes of this prodigious swordsman were clear as he praised, "Your physique is merely that of a mortal, yet you actually dared to challenge that ape from Sun Scorch Mountain! More importantly, you actually managed to survive! This is an absolute miracle!"

source: 宁姚很是惊讶，目瞪口呆。
en_us: Ning Yao was astonished to hear this.

source: 宁姚微微凑过脑袋，看着那几幅画谱，点头道：“有一招拳法，在江湖上传了几千年，都没有失传，跟这一招拳谱有几分神似啊。”
en_us: Ning Yao stuck her head over and looked at the diagrams, nodding and saying, "There's a fist technique that's been passed down in the cultivation world for thousands of years without getting lost, and it does seem quite similar to this Mountain Shaking Fist Technique."

source: 宁姚忍不住问道：“你是谁”
en_us: "Who are you?" Ning Yao couldn't help but ask.

source: 宁姚怀疑这个说法的真实性。
en_us: Ning Yao was skeptical of this explanation.

source: 宁姚怒目相向。
en_us: Ning Yao replied with an angry glare.
